{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<pad>": 0,
      "<s>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "¨": 106,
      "©": 107,
      "ª": 108,
      "«": 109,
      "¬": 110,
      "®": 111,
      "¯": 112,
      "°": 113,
      "±": 114,
      "²": 115,
      "³": 116,
      "´": 117,
      "µ": 118,
      "¶": 119,
      "·": 120,
      "¸": 121,
      "¹": 122,
      "º": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "À": 129,
      "Á": 130,
      "Â": 131,
      "Ã": 132,
      "Ä": 133,
      "Å": 134,
      "Æ": 135,
      "Ç": 136,
      "È": 137,
      "É": 138,
      "Ê": 139,
      "Ë": 140,
      "Ì": 141,
      "Í": 142,
      "Î": 143,
      "Ï": 144,
      "Ð": 145,
      "Ñ": 146,
      "Ò": 147,
      "Ó": 148,
      "Ô": 149,
      "Õ": 150,
      "Ö": 151,
      "×": 152,
      "Ø": 153,
      "Ù": 154,
      "Ú": 155,
      "Û": 156,
      "Ü": 157,
      "Ý": 158,
      "Þ": 159,
      "ß": 160,
      "à": 161,
      "á": 162,
      "â": 163,
      "ã": 164,
      "ä": 165,
      "å": 166,
      "æ": 167,
      "ç": 168,
      "è": 169,
      "é": 170,
      "ê": 171,
      "ë": 172,
      "ì": 173,
      "í": 174,
      "î": 175,
      "ï": 176,
      "ð": 177,
      "ñ": 178,
      "ò": 179,
      "ó": 180,
      "ô": 181,
      "õ": 182,
      "ö": 183,
      "÷": 184,
      "ø": 185,
      "ù": 186,
      "ú": 187,
      "û": 188,
      "ü": 189,
      "ý": 190,
      "þ": 191,
      "ÿ": 192,
      "Ā": 193,
      "ā": 194,
      "Ă": 195,
      "ă": 196,
      "Ą": 197,
      "ą": 198,
      "Ć": 199,
      "ć": 200,
      "Ĉ": 201,
      "ĉ": 202,
      "Ċ": 203,
      "ċ": 204,
      "Č": 205,
      "č": 206,
      "Ď": 207,
      "ď": 208,
      "Đ": 209,
      "đ": 210,
      "Ē": 211,
      "ē": 212,
      "Ĕ": 213,
      "ĕ": 214,
      "Ė": 215,
      "ė": 216,
      "Ę": 217,
      "ę": 218,
      "Ě": 219,
      "ě": 220,
      "Ĝ": 221,
      "ĝ": 222,
      "Ğ": 223,
      "ğ": 224,
      "Ġ": 225,
      "ġ": 226,
      "Ģ": 227,
      "ģ": 228,
      "Ĥ": 229,
      "ĥ": 230,
      "Ħ": 231,
      "ħ": 232,
      "Ĩ": 233,
      "ĩ": 234,
      "Ī": 235,
      "ī": 236,
      "Ĭ": 237,
      "ĭ": 238,
      "Į": 239,
      "į": 240,
      "İ": 241,
      "ı": 242,
      "Ĳ": 243,
      "ĳ": 244,
      "Ĵ": 245,
      "ĵ": 246,
      "Ķ": 247,
      "ķ": 248,
      "ĸ": 249,
      "Ĺ": 250,
      "ĺ": 251,
      "Ļ": 252,
      "ļ": 253,
      "Ľ": 254,
      "ľ": 255,
      "Ŀ": 256,
      "ŀ": 257,
      "Ł": 258,
      "ł": 259,
      "Ń": 260,
      "Ġ}": 261,
      "Ġ{": 262,
      "Ġ\\": 263,
      "Ġ_": 264,
      "Ġ^": 265,
      "Ġ)": 266,
      "Ġ(": 267,
      "Ġ1": 268,
      "Ġ2": 269,
      "Ġ=": 270,
      "Ġ,": 271,
      "Ġ-": 272,
      "ra": 273,
      "Ġ+": 274,
      "ma": 275,
      "rac": 276,
      "frac": 277,
      "ta": 278,
      "Ġ0": 279,
      "ig": 280,
      "Ġi": 281,
      "Ġx": 282,
      "al": 283,
      "Ġn": 284,
      "le": 285,
      "ar": 286,
      "me": 287,
      "th": 288,
      "in": 289,
      "Ġ.": 290,
      "ft": 291,
      "ph": 292,
      "Ġt": 293,
      "Ġk": 294,
      "math": 295,
      "Ġd": 296,
      "igh": 297,
      "righ": 298,
      "am": 299,
      "Ġa": 300,
      "ti": 301,
      "eta": 302,
      "left": 303,
      "right": 304,
      "Ġm": 305,
      "Ġj": 306,
      "Ġ\\,": 307,
      "Ġp": 308,
      "de": 309,
      "Ġs": 310,
      "Ġr": 311,
      "Ġ3": 312,
      "Ġe": 313,
      "si": 314,
      "Ġ|": 315,
      "ri": 316,
      "mu": 317,
      "Ġc": 318,
      "Ġ&": 319,
      "pha": 320,
      "alpha": 321,
      "da": 322,
      "Ġl": 323,
      "ot": 324,
      "dot": 325,
      "bda": 326,
      "ambda": 327,
      "Ġu": 328,
      "Ġf": 329,
      "Ġg": 330,
      "ĠA": 331,
      "Ġz": 332,
      "Ġ4": 333,
      "psi": 334,
      "pri": 335,
      "prime": 336,
      "Ġ\\\\": 337,
      "Ġy": 338,
      "par": 339,
      "tial": 340,
      "partial": 341,
      "to": 342,
      "phi": 343,
      "rm": 344,
      "Ġb": 345,
      "mathrm": 346,
      "na": 347,
      "lta": 348,
      "Ġq": 349,
      "su": 350,
      "amma": 351,
      "lambda": 352,
      "cal": 353,
      "ĠN": 354,
      "Ġ~": 355,
      "pi": 356,
      "sum": 357,
      "op": 358,
      "ĠT": 359,
      "nu": 360,
      "Ġ]": 361,
      "lo": 362,
      "var": 363,
      "ope": 364,
      "tor": 365,
      "rator": 366,
      "operator": 367,
      "name": 368,
      "operatorname": 369,
      "int": 370,
      "igma": 371,
      "Ġv": 372,
      "ga": 373,
      "mega": 374,
      "ĠB": 375,
      "ĠR": 376,
      "beta": 377,
      "rt": 378,
      "Ġh": 379,
      "ĠL": 380,
      "ve": 381,
      "Ġ[": 382,
      "Ġ/": 383,
      "lon": 384,
      "bf": 385,
      "ĠM": 386,
      "theta": 387,
      "delta": 388,
      "ĠD": 389,
      "ĠX": 390,
      "ng": 391,
      "Ġ\\;": 392,
      "psilon": 393,
      "bar": 394,
      "sigma": 395,
      "gamma": 396,
      "ngle": 397,
      "ĠC": 398,
      "ĠF": 399,
      "ĠS": 400,
      "lde": 401,
      "tilde": 402,
      "cdot": 403,
      "epsilon": 404,
      "ĠH": 405,
      "sq": 406,
      "ĠP": 407,
      "hi": 408,
      "ho": 409,
      "rho": 410,
      "ray": 411,
      "array": 412,
      "la": 413,
      "ha": 414,
      "hat": 415,
      "be": 416,
      "nd": 417,
      "sqrt": 418,
      "Ġo": 419,
      "end": 420,
      "gin": 421,
      "begin": 422,
      "qu": 423,
      "tau": 424,
      "inft": 425,
      "infty": 426,
      "ĠE": 427,
      "xi": 428,
      "ĠV": 429,
      "ĠI": 430,
      "Ġ5": 431,
      "omega": 432,
      "ĠG": 433,
      "Ġ*": 434,
      "Ġw": 435,
      "mathcal": 436,
      "big": 437,
      "ro": 438,
      "ge": 439,
      "Ġ:": 440,
      "mes": 441,
      "times": 442,
      "leq": 443,
      "ad": 444,
      "ĠQ": 445,
      "quad": 446,
      "ĠK": 447,
      "mathbf": 448,
      "dots": 449,
      "Ġ6": 450,
      "De": 451,
      "Delta": 452,
      "ap": 453,
      "varphi": 454,
      "Ġ\\}": 455,
      "ll": 456,
      "ĠJ": 457,
      "ĠU": 458,
      "Gamma": 459,
      "rangle": 460,
      "Phi": 461,
      "lin": 462,
      "line": 463,
      "tri": 464,
      "rline": 465,
      "Ġ\\{": 466,
      "Ġ;": 467,
      "ĠW": 468,
      "Omega": 469,
      "ĠZ": 470,
      "matri": 471,
      "matrix": 472,
      "ove": 473,
      "Ġ8": 474,
      "Ġ\\|": 475,
      "app": 476,
      "\\{": 477,
      "se": 478,
      "ell": 479,
      "vec": 480,
      "Big": 481,
      "Lambda": 482,
      "pm": 483,
      "bb": 484,
      "mathbb": 485,
      "chi": 486,
      "Ġ<": 487,
      "ĠY": 488,
      "bla": 489,
      "nabla": 490,
      "langle": 491,
      "tar": 492,
      "overline": 493,
      "varepsilon": 494,
      "ĠO": 495,
      "row": 496,
      "Ġ>": 497,
      "wi": 498,
      "wide": 499,
      "ed": 500,
      "appa": 501,
      "kappa": 502,
      "cdots": 503,
      "tarrow": 504,
      "ldots": 505,
      "Psi": 506,
      "zeta": 507,
      "Ġ\\!": 508,
      "geq": 509,
      "Ġ7": 510,
      "ex": 511,
      "rightarrow": 512,
      "iv": 513,
      "otimes": 514,
      "bo": 515,
      "Ġ9": 516,
      "bol": 517,
      "st": 518,
      "qquad": 519,
      "pro": 520,
      "rc": 521,
      "prod": 522,
      "equ": 523,
      "equiv": 524,
      "set": 525,
      "ci": 526,
      "circ": 527,
      "vert": 528,
      "widetilde": 529,
      "ca": 530,
      "ses": 531,
      "cases": 532,
      "Sigma": 533,
      "Ġ!": 534,
      "dag": 535,
      "co": 536,
      "tex": 537,
      "wed": 538,
      "wedge": 539,
      "\\}": 540,
      "bigg": 541,
      "text": 542,
      "un": 543,
      "sin": 544,
      "unde": 545,
      "sim": 546,
      "ger": 547,
      "dagger": 548,
      "eq": 549,
      "ign": 550,
      "align": 551,
      "aligned": 552,
      "us": 553,
      "Pi": 554,
      "cos": 555,
      "up": 556,
      "widehat": 557,
      "cap": 558,
      "mi": 559,
      "ast": 560,
      "Th": 561,
      "Theta": 562,
      "Ġ\\:": 563,
      "bold": 564,
      "ck": 565,
      "neq": 566,
      "mid": 567,
      "sub": 568,
      "cup": 569,
      "om": 570,
      "brac": 571,
      "bin": 572,
      "binom": 573,
      "fra": 574,
      "mathfra": 575,
      "mathfrak": 576,
      "ln": 577,
      "lus": 578,
      "sy": 579,
      "sym": 580,
      "hbar": 581,
      "symbol": 582,
      "boldsymbol": 583,
      "oplus": 584,
      "sp": 585,
      "angle": 586,
      "underline": 587,
      "exp": 588,
      "fo": 589,
      "rox": 590,
      "approx": 591,
      "re": 592,
      "rall": 593,
      "forall": 594,
      "subset": 595,
      "\\|": 596,
      "er": 597,
      "yle": 598,
      "style": 599,
      "brace": 600,
      "Ve": 601,
      "sta": 602,
      "stack": 603,
      "Vert": 604,
      "star": 605,
      "per": 606,
      "perp": 607,
      "io": 608,
      "iota": 609,
      "under": 610,
      "over": 611,
      "vartheta": 612,
      "or": 613,
      "bigl": 614,
      "bigr": 615,
      "textrm": 616,
      "di": 617,
      "not": 618,
      "sf": 619,
      "mp": 620,
      "ac": 621,
      "Xi": 622,
      "log": 623,
      "Bigr": 624,
      "rel": 625,
      "meq": 626,
      "simeq": 627,
      "Bigl": 628,
      "stackrel": 629,
      "flo": 630,
      "floor": 631,
      "lay": 632,
      "splay": 633,
      "display": 634,
      "displaystyle": 635,
      "spac": 636,
      "space": 637,
      "Bigg": 638,
      "inus": 639,
      "varrho": 640,
      "vdots": 641,
      "long": 642,
      "Ġ'": 643,
      "minus": 644,
      "textbf": 645,
      "setminus": 646,
      "biggr": 647,
      "biggl": 648,
      "div": 649,
      "mathsf": 650,
      "Upsilon": 651,
      "sc": 652,
      "sla": 653,
      "hspace": 654,
      "lle": 655,
      "sh": 656,
      "tan": 657,
      "longrightarrow": 658,
      "triangle": 659,
      "pt": 660,
      "ript": 661,
      "script": 662,
      "ddot": 663,
      "underbrace": 664,
      "sinh": 665,
      "brack": 666,
      "sto": 667,
      "psto": 668,
      "mapsto": 669,
      "ch": 670,
      "top": 671,
      "substack": 672,
      "leftrightarrow": 673,
      "eck": 674,
      "check": 675,
      "cosh": 676,
      "bigcup": 677,
      "lor": 678,
      "sup": 679,
      "supset": 680,
      "oint": 681,
      "bu": 682,
      "varpi": 683,
      "rfloor": 684,
      "li": 685,
      "notin": 686,
      "upsilon": 687,
      "lfloor": 688,
      "sqcup": 689,
      "Ġ\\#": 690,
      "vee": 691,
      "subseteq": 692,
      "boldmath": 693,
      "od": 694,
      "parrow": 695,
      "textstyle": 696,
      "pr": 697,
      "arrow": 698,
      "ddots": 699,
      "colon": 700,
      "uparrow": 701,
      "bigoplus": 702,
      "llet": 703,
      "bullet": 704,
      "lim": 705,
      "nt": 706,
      "opto": 707,
      "propto": 708,
      "overrightarrow": 709,
      "slant": 710,
      "overbrace": 711,
      "it": 712,
      "Righ": 713,
      "Rightarrow": 714,
      "ow": 715,
      "own": 716,
      "il": 717,
      "bot": 718,
      "slash": 719,
      "underset": 720,
      "down": 721,
      "imath": 722,
      "sqcap": 723,
      "Re": 724,
      "varsigma": 725,
      "arp": 726,
      "cong": 727,
      "eil": 728,
      "downarrow": 729,
      "lef": 730,
      "overset": 731,
      "circle": 732,
      "det": 733,
      "leftarrow": 734,
      "ss": 735,
      "emp": 736,
      "ty": 737,
      "empty": 738,
      "emptyset": 739,
      "no": 740,
      "scriptstyle": 741,
      "circled": 742,
      "ara": 743,
      "para": 744,
      "llel": 745,
      "parallel": 746,
      "textcircled": 747,
      "bre": 748,
      "Ġ--": 749,
      "Im": 750,
      "leqslant": 751,
      "breve": 752,
      "ack": 753,
      "back": 754,
      "varPhi": 755,
      "backslash": 756,
      "gg": 757,
      "textup": 758,
      "less": 759,
      "box": 760,
      "ne": 761,
      "varDelta": 762,
      "sharp": 763,
      "varGamma": 764,
      "ze": 765,
      "lesssim": 766,
      "size": 767,
      "mal": 768,
      "nto": 769,
      "phanto": 770,
      "phantom": 771,
      "varTheta": 772,
      "ut": 773,
      "varPsi": 774,
      "nor": 775,
      "normal": 776,
      "varUpsilon": 777,
      "varOmega": 778,
      "mbe": 779,
      "numbe": 780,
      "number": 781,
      "nonumber": 782,
      "atop": 783,
      "bigcap": 784,
      "mod": 785,
      "wp": 786,
      "tt": 787,
      "varLambda": 788,
      "xist": 789,
      "xists": 790,
      "ct": 791,
      "exists": 792,
      "varXi": 793,
      "Lo": 794,
      "varSigma": 795,
      "textnormal": 796,
      "pmod": 797,
      "Long": 798,
      "varPi": 799,
      "ect": 800,
      "jmath": 801,
      "rvert": 802,
      "lvert": 803,
      "ing": 804,
      "rbrace": 805,
      "Biggr": 806,
      "sma": 807,
      "Biggl": 808,
      "ject": 809,
      "bject": 810,
      "acut": 811,
      "acute": 812,
      "scriptsize": 813,
      "rceil": 814,
      "small": 815,
      "lbrack": 816,
      "ceil": 817,
      "lceil": 818,
      "tin": 819,
      "tiny": 820,
      "scriptscriptstyle": 821,
      "odot": 822,
      "iint": 823,
      "Le": 824,
      "cot": 825,
      "Left": 826,
      "Leftrightarrow": 827,
      "arc": 828,
      "mathr": 829,
      "cfrac": 830,
      "ref": 831,
      "mathring": 832,
      "ker": 833,
      "pre": 834,
      "en": 835,
      "mathit": 836,
      "bmod": 837,
      "ond": 838,
      "overleftarrow": 839,
      "hline": 840,
      "Longrightarrow": 841,
      "pmb": 842,
      "amond": 843,
      "kern": 844,
      "sk": 845,
      "geqslant": 846,
      "diamond": 847,
      "ip": 848,
      "skip": 849,
      "arctan": 850,
      "xrightarrow": 851,
      "mathtt": 852,
      "lbrace": 853,
      "eqq": 854,
      "lar": 855,
      "prec": 856,
      "coloneqq": 857,
      "lVert": 858,
      "fla": 859,
      "flat": 860,
      "rVert": 861,
      "arpo": 862,
      "bigwedge": 863,
      "dotsc": 864,
      "gra": 865,
      "grave": 866,
      "object": 867,
      "land": 868,
      "ĠObject": 869,
      "eph": 870,
      "aleph": 871,
      "underrightarrow": 872,
      "overleftrightarrow": 873,
      "Longleftrightarrow": 874,
      "rbrack": 875,
      "arpoo": 876,
      "tanh": 877,
      "underleftarrow": 878,
      "tit": 879,
      "textit": 880,
      "enspace": 881,
      "Bo": 882,
      "underleftrightarrow": 883,
      "Box": 884,
      "ni": 885,
      "squ": 886,
      "triangleq": 887,
      "mathop": 888,
      "ff": 889,
      "iff": 890,
      "bigtriangle": 891,
      "mit": 892,
      "bigotimes": 893,
      "neg": 894,
      "eqref": 895,
      "are": 896,
      "square": 897,
      "coth": 898,
      "\\,": 899,
      "dash": 900,
      "boxtimes": 901,
      "hdots": 902,
      "tharpoo": 903,
      "underbar": 904,
      "dim": 905,
      "textsf": 906,
      "cc": 907,
      "varkappa": 908,
      "ere": 909,
      "there": 910,
      "fore": 911,
      "therefore": 912,
      "imp": 913,
      "impli": 914,
      "es": 915,
      "implies": 916,
      "Ġ\\%": 917,
      "sb": 918,
      "longleftrightarrow": 919,
      "succ": 920,
      "fbox": 921,
      "otnot": 922,
      "footnot": 923,
      "footnote": 924,
      "ominus": 925,
      "bigtriangleup": 926,
      "doteq": 927,
      "em": 928,
      "Ġ\\_": 929,
      "vphantom": 930,
      "jlim": 931,
      "ok": 932,
      "hook": 933,
      "hd": 934,
      "longmapsto": 935,
      "cro": 936,
      "omi": 937,
      "cron": 938,
      "omicron": 939,
      "bigsqcup": 940,
      "Ġ?": 941,
      "nup": 942,
      "tharpoonup": 943,
      "texttt": 944,
      "footnotesize": 945,
      "vdash": 946,
      "hookrightarrow": 947,
      "textsc": 948,
      "\\#": 949,
      "rightharpoonup": 950,
      "bigvee": 951,
      "large": 952,
      "tabu": 953,
      "tabular": 954,
      "lap": 955,
      "supseteq": 956,
      "emph": 957,
      "Ti": 958,
      "Tilde": 959,
      "Ġ\"": 960,
      "thing": 961,
      "varno": 962,
      "varnothing": 963,
      "sec": 964,
      "rtimes": 965,
      "Ġ`": 966,
      "ral": 967,
      "triangleright": 968,
      "\\;": 969,
      "min": 970,
      "dotsb": 971,
      "searrow": 972,
      "mkern": 973,
      "plus": 974,
      "med": 975,
      "boxplus": 976,
      "ãĢ": 977,
      "Lar": 978,
      "Large": 979,
      "tu": 980,
      "rai": 981,
      "natu": 982,
      "arcsin": 983,
      "natural": 984,
      "raise": 985,
      "nmid": 986,
      "rhd": 987,
      "\\:": 988,
      "triangleleft": 989,
      "medskip": 990,
      "csc": 991,
      "dle": 992,
      "middle": 993,
      "ãĢģ": 994,
      "hf": 995,
      "enskip": 996,
      "deg": 997,
      "cdotp": 998,
      "ts": 999,
      "gets": 1000,
      "boxed": 1001,
      "preceq": 1002,
      "asym": 1003,
      "asymp": 1004,
      "on": 1005,
      "arg": 1006,
      "AA": 1007,
      "ner": 1008,
      "Ġ\\&": 1009,
      "inter": 1010,
      "intercal": 1011,
      "cop": 1012,
      "projlim": 1013,
      "ou": 1014,
      "ĠãĢģ": 1015,
      "subsetneq": 1016,
      "rod": 1017,
      "coprod": 1018,
      "pou": 1019,
      "smi": 1020,
      "varprojlim": 1021,
      "nds": 1022,
      "pounds": 1023,
      "smile": 1024,
      "drel": 1025,
      "buil": 1026,
      "buildrel": 1027,
      "nearrow": 1028,
      "smallsetminus": 1029,
      "Ġ\\/": 1030,
      "injlim": 1031,
      "succeq": 1032,
      "low": 1033,
      "ill": 1034,
      "put": 1035,
      "otect": 1036,
      "protect": 1037,
      "varinjlim": 1038,
      "prescript": 1039,
      "rut": 1040,
      "strut": 1041,
      "lnot": 1042,
      "iiint": 1043,
      "nfrac": 1044,
      "rlap": 1045,
      "ver": 1046,
      "genfrac": 1047,
      "\\!": 1048,
      "intop": 1049,
      "suit": 1050,
      "gt": 1051,
      "sl": 1052,
      "hfill": 1053,
      "mathver": 1054,
      "sion": 1055,
      "dotsm": 1056,
      "mathversion": 1057,
      "ddagger": 1058,
      "gtr": 1059,
      "max": 1060,
      "ke": 1061,
      "make": 1062,
      "makebox": 1063,
      "pe": 1064,
      "use": 1065,
      "beca": 1066,
      "because": 1067,
      "Bar": 1068,
      "ak": 1069,
      "noalign": 1070,
      "break": 1071,
      "leng": 1072,
      "length": 1073,
      "tch": 1074,
      "ule": 1075,
      "bigtriangledown": 1076,
      "frow": 1077,
      "lhd": 1078,
      "frown": 1079,
      "ipsi": 1080,
      "vspace": 1081,
      "mathell": 1082,
      "rcor": 1083,
      "real": 1084,
      "ipsis": 1085,
      "mathellipsis": 1086,
      "rcorner": 1087,
      "mo": 1088,
      "Ġâ": 1089,
      "null": 1090,
      "mode": 1091,
      "ĠâĢ": 1092,
      "ls": 1093,
      "lrcorner": 1094,
      "mspace": 1095,
      "gtrsim": 1096,
      "models": 1097,
      "smallskip": 1098,
      "vline": 1099,
      "Ġ\\*": 1100,
      "col": 1101,
      "Bbb": 1102,
      "arpoon": 1103,
      "Bbbk": 1104,
      "allow": 1105,
      "rule": 1106,
      "uph": 1107,
      "upharpoon": 1108,
      "hslash": 1109,
      "llap": 1110,
      "ĠâĢĲ": 1111,
      "upharpoonright": 1112,
      "deset": 1113,
      "sideset": 1114,
      "allowbreak": 1115,
      "ltimes": 1116,
      "labe": 1117,
      "bigm": 1118,
      "raisebox": 1119,
      "label": 1120,
      "arrayst": 1121,
      "retch": 1122,
      "arraystretch": 1123,
      "bigstar": 1124,
      "sep": 1125,
      "smash": 1126,
      "diamondsuit": 1127,
      "sha": 1128,
      "shape": 1129,
      "colsep": 1130,
      "ns": 1131,
      "tharpoons": 1132,
      "Ġ\\-": 1133,
      "new": 1134,
      "ce": 1135,
      "normalsize": 1136,
      "arraycolsep": 1137,
      "thin": 1138,
      "rightlef": 1139,
      "rightleftharpoons": 1140,
      "SS": 1141,
      "he": 1142,
      "dast": 1143,
      "setlength": 1144,
      "circledast": 1145,
      "cent": 1146,
      "ure": 1147,
      "pict": 1148,
      "picture": 1149,
      "thinspace": 1150,
      "ddag": 1151,
      "hphantom": 1152,
      "mma": 1153,
      "rd": 1154,
      "surd": 1155,
      "comma": 1156,
      "command": 1157,
      "uplus": 1158,
      "newcommand": 1159,
      "renewcommand": 1160,
      "Vec": 1161,
      "limit": 1162,
      "Ġ---": 1163,
      "Vdash": 1164,
      "eth": 1165,
      "longleftarrow": 1166,
      "cu": 1167,
      "leqq": 1168,
      "cur": 1169,
      "oslash": 1170,
      "sure": 1171,
      "mathc": 1172,
      "bigcirc": 1173,
      "ensure": 1174,
      "ensuremath": 1175,
      "xleftarrow": 1176,
      "varlim": 1177,
      "inte": 1178,
      "triangledown": 1179,
      "rner": 1180,
      "sho": 1181,
      "mathor": 1182,
      "corner": 1183,
      "short": 1184,
      "mathord": 1185,
      "Ġcm": 1186,
      "rtex": 1187,
      "intertex": 1188,
      "intertext": 1189,
      "hfil": 1190,
      "an": 1191,
      "bigskip": 1192,
      "wr": 1193,
      "vartriangle": 1194,
      "warrow": 1195,
      "updownarrow": 1196,
      "ae": 1197,
      "mathrel": 1198,
      "endaligned": 1199
    },
    "merges": [
      "Ġ }",
      "Ġ {",
      "Ġ \\",
      "Ġ _",
      "Ġ ^",
      "Ġ )",
      "Ġ (",
      "Ġ 1",
      "Ġ 2",
      "Ġ =",
      "Ġ ,",
      "Ġ -",
      "r a",
      "Ġ +",
      "m a",
      "ra c",
      "f rac",
      "t a",
      "Ġ 0",
      "i g",
      "Ġ i",
      "Ġ x",
      "a l",
      "Ġ n",
      "l e",
      "a r",
      "m e",
      "t h",
      "i n",
      "Ġ .",
      "f t",
      "p h",
      "Ġ t",
      "Ġ k",
      "ma th",
      "Ġ d",
      "ig h",
      "r igh",
      "a m",
      "Ġ a",
      "t i",
      "e ta",
      "le ft",
      "righ t",
      "Ġ m",
      "Ġ j",
      "Ġ\\ ,",
      "Ġ p",
      "d e",
      "Ġ s",
      "Ġ r",
      "Ġ 3",
      "Ġ e",
      "s i",
      "Ġ |",
      "r i",
      "m u",
      "Ġ c",
      "Ġ &",
      "ph a",
      "al pha",
      "d a",
      "Ġ l",
      "o t",
      "d ot",
      "b da",
      "am bda",
      "Ġ u",
      "Ġ f",
      "Ġ g",
      "Ġ A",
      "Ġ z",
      "Ġ 4",
      "p si",
      "p ri",
      "pri me",
      "Ġ\\ \\",
      "Ġ y",
      "p ar",
      "ti al",
      "par tial",
      "t o",
      "ph i",
      "r m",
      "Ġ b",
      "math rm",
      "n a",
      "l ta",
      "Ġ q",
      "s u",
      "am ma",
      "l ambda",
      "c al",
      "Ġ N",
      "Ġ ~",
      "p i",
      "su m",
      "o p",
      "Ġ T",
      "n u",
      "Ġ ]",
      "l o",
      "v ar",
      "op e",
      "to r",
      "ra tor",
      "ope rator",
      "na me",
      "operator name",
      "in t",
      "ig ma",
      "Ġ v",
      "g a",
      "me ga",
      "Ġ B",
      "Ġ R",
      "b eta",
      "r t",
      "Ġ h",
      "Ġ L",
      "v e",
      "Ġ [",
      "Ġ /",
      "lo n",
      "b f",
      "Ġ M",
      "th eta",
      "de lta",
      "Ġ D",
      "Ġ X",
      "n g",
      "Ġ\\ ;",
      "psi lon",
      "b ar",
      "s igma",
      "g amma",
      "ng le",
      "Ġ C",
      "Ġ F",
      "Ġ S",
      "l de",
      "ti lde",
      "c dot",
      "e psilon",
      "Ġ H",
      "s q",
      "Ġ P",
      "h i",
      "h o",
      "r ho",
      "ra y",
      "ar ray",
      "l a",
      "h a",
      "ha t",
      "b e",
      "n d",
      "sq rt",
      "Ġ o",
      "e nd",
      "g in",
      "be gin",
      "q u",
      "ta u",
      "in ft",
      "inft y",
      "Ġ E",
      "x i",
      "Ġ V",
      "Ġ I",
      "Ġ 5",
      "o mega",
      "Ġ G",
      "Ġ *",
      "Ġ w",
      "math cal",
      "b ig",
      "r o",
      "g e",
      "Ġ :",
      "me s",
      "ti mes",
      "le q",
      "a d",
      "Ġ Q",
      "qu ad",
      "Ġ K",
      "math bf",
      "dot s",
      "Ġ 6",
      "D e",
      "De lta",
      "a p",
      "var phi",
      "Ġ\\ }",
      "l l",
      "Ġ J",
      "Ġ U",
      "G amma",
      "ra ngle",
      "P hi",
      "l in",
      "lin e",
      "t ri",
      "r line",
      "Ġ\\ {",
      "Ġ ;",
      "Ġ W",
      "O mega",
      "Ġ Z",
      "ma tri",
      "matri x",
      "o ve",
      "Ġ 8",
      "Ġ\\ |",
      "ap p",
      "\\ {",
      "s e",
      "e ll",
      "ve c",
      "B ig",
      "L ambda",
      "p m",
      "b b",
      "math bb",
      "c hi",
      "Ġ <",
      "Ġ Y",
      "b la",
      "na bla",
      "la ngle",
      "ta r",
      "ove rline",
      "var epsilon",
      "Ġ O",
      "ro w",
      "Ġ >",
      "w i",
      "wi de",
      "e d",
      "app a",
      "k appa",
      "cdot s",
      "tar row",
      "l dots",
      "P si",
      "z eta",
      "Ġ\\ !",
      "ge q",
      "Ġ 7",
      "e x",
      "righ tarrow",
      "i v",
      "o times",
      "b o",
      "Ġ 9",
      "bo l",
      "s t",
      "q quad",
      "p ro",
      "r c",
      "pro d",
      "e qu",
      "equ iv",
      "se t",
      "c i",
      "ci rc",
      "ve rt",
      "wide tilde",
      "c a",
      "se s",
      "ca ses",
      "S igma",
      "Ġ !",
      "da g",
      "c o",
      "t ex",
      "w ed",
      "wed ge",
      "\\ }",
      "big g",
      "tex t",
      "u n",
      "s in",
      "un de",
      "si m",
      "ge r",
      "dag ger",
      "e q",
      "ig n",
      "al ign",
      "align ed",
      "u s",
      "P i",
      "co s",
      "u p",
      "wide hat",
      "c ap",
      "m i",
      "a st",
      "T h",
      "Th eta",
      "Ġ\\ :",
      "bol d",
      "c k",
      "n eq",
      "mi d",
      "su b",
      "c up",
      "o m",
      "b rac",
      "b in",
      "bin om",
      "f ra",
      "math fra",
      "mathfra k",
      "l n",
      "l us",
      "s y",
      "sy m",
      "h bar",
      "sym bol",
      "bold symbol",
      "op lus",
      "s p",
      "a ngle",
      "unde rline",
      "ex p",
      "f o",
      "ro x",
      "app rox",
      "r e",
      "ra ll",
      "fo rall",
      "sub set",
      "\\ |",
      "e r",
      "y le",
      "st yle",
      "brac e",
      "V e",
      "s ta",
      "sta ck",
      "Ve rt",
      "s tar",
      "p er",
      "per p",
      "i o",
      "io ta",
      "unde r",
      "ove r",
      "var theta",
      "o r",
      "big l",
      "big r",
      "text rm",
      "d i",
      "n ot",
      "s f",
      "m p",
      "a c",
      "X i",
      "lo g",
      "Big r",
      "re l",
      "me q",
      "si meq",
      "Big l",
      "stack rel",
      "f lo",
      "flo or",
      "la y",
      "sp lay",
      "di splay",
      "display style",
      "sp ac",
      "spac e",
      "Big g",
      "in us",
      "var rho",
      "v dots",
      "lon g",
      "Ġ '",
      "m inus",
      "text bf",
      "set minus",
      "bigg r",
      "bigg l",
      "d iv",
      "math sf",
      "U psilon",
      "s c",
      "s la",
      "h space",
      "l le",
      "s h",
      "ta n",
      "long rightarrow",
      "tri angle",
      "p t",
      "ri pt",
      "sc ript",
      "d dot",
      "under brace",
      "sin h",
      "brac k",
      "s to",
      "p sto",
      "ma psto",
      "c h",
      "to p",
      "sub stack",
      "left rightarrow",
      "e ck",
      "ch eck",
      "cos h",
      "big cup",
      "lo r",
      "su p",
      "sup set",
      "o int",
      "b u",
      "var pi",
      "r floor",
      "l i",
      "not in",
      "u psilon",
      "l floor",
      "sq cup",
      "Ġ\\ #",
      "ve e",
      "subset eq",
      "bold math",
      "o d",
      "par row",
      "text style",
      "p r",
      "ar row",
      "d dots",
      "co lon",
      "u parrow",
      "big oplus",
      "lle t",
      "bu llet",
      "li m",
      "n t",
      "op to",
      "pr opto",
      "over rightarrow",
      "sla nt",
      "over brace",
      "i t",
      "R igh",
      "Righ tarrow",
      "o w",
      "ow n",
      "i l",
      "b ot",
      "sla sh",
      "under set",
      "d own",
      "i math",
      "sq cap",
      "R e",
      "var sigma",
      "ar p",
      "co ng",
      "e il",
      "down arrow",
      "le f",
      "over set",
      "circ le",
      "de t",
      "lef tarrow",
      "s s",
      "e mp",
      "t y",
      "emp ty",
      "empty set",
      "n o",
      "script style",
      "circle d",
      "a ra",
      "p ara",
      "lle l",
      "para llel",
      "text circled",
      "b re",
      "Ġ- -",
      "I m",
      "leq slant",
      "bre ve",
      "a ck",
      "b ack",
      "var Phi",
      "back slash",
      "g g",
      "text up",
      "le ss",
      "bo x",
      "n e",
      "var Delta",
      "sh arp",
      "var Gamma",
      "z e",
      "less sim",
      "si ze",
      "ma l",
      "n to",
      "pha nto",
      "phanto m",
      "var Theta",
      "u t",
      "var Psi",
      "n or",
      "nor mal",
      "var Upsilon",
      "var Omega",
      "m be",
      "nu mbe",
      "numbe r",
      "no number",
      "a top",
      "big cap",
      "m od",
      "w p",
      "t t",
      "var Lambda",
      "xi st",
      "xist s",
      "c t",
      "e xists",
      "var Xi",
      "L o",
      "var Sigma",
      "text normal",
      "pm od",
      "Lo ng",
      "var Pi",
      "e ct",
      "j math",
      "r vert",
      "l vert",
      "in g",
      "r brace",
      "Bigg r",
      "s ma",
      "Bigg l",
      "j ect",
      "b ject",
      "ac ut",
      "acut e",
      "script size",
      "rc eil",
      "sma ll",
      "l brack",
      "c eil",
      "l ceil",
      "t in",
      "tin y",
      "script scriptstyle",
      "o dot",
      "i int",
      "L e",
      "c ot",
      "Le ft",
      "Left rightarrow",
      "ar c",
      "math r",
      "c frac",
      "re f",
      "mathr ing",
      "k er",
      "p re",
      "e n",
      "math it",
      "b mod",
      "o nd",
      "over leftarrow",
      "h line",
      "Long rightarrow",
      "pm b",
      "am ond",
      "ker n",
      "s k",
      "geq slant",
      "di amond",
      "i p",
      "sk ip",
      "arc tan",
      "x rightarrow",
      "math tt",
      "l brace",
      "eq q",
      "l ar",
      "pre c",
      "colon eqq",
      "l Vert",
      "f la",
      "fla t",
      "r Vert",
      "arp o",
      "big wedge",
      "dots c",
      "g ra",
      "gra ve",
      "o bject",
      "la nd",
      "ĠO bject",
      "e ph",
      "al eph",
      "under rightarrow",
      "over leftrightarrow",
      "Long leftrightarrow",
      "r brack",
      "arpo o",
      "tan h",
      "under leftarrow",
      "ti t",
      "tex tit",
      "en space",
      "B o",
      "under leftrightarrow",
      "Bo x",
      "n i",
      "sq u",
      "triangle q",
      "math op",
      "f f",
      "i ff",
      "big triangle",
      "mi t",
      "big otimes",
      "ne g",
      "eq ref",
      "ar e",
      "squ are",
      "co th",
      "\\ ,",
      "da sh",
      "box times",
      "h dots",
      "th arpoo",
      "under bar",
      "di m",
      "text sf",
      "c c",
      "var kappa",
      "e re",
      "th ere",
      "fo re",
      "there fore",
      "i mp",
      "imp li",
      "e s",
      "impli es",
      "Ġ\\ %",
      "s b",
      "long leftrightarrow",
      "su cc",
      "f box",
      "ot not",
      "fo otnot",
      "footnot e",
      "om inus",
      "bigtriangle up",
      "dot eq",
      "e m",
      "Ġ\\ _",
      "v phantom",
      "j lim",
      "o k",
      "ho ok",
      "h d",
      "long mapsto",
      "c ro",
      "o mi",
      "cro n",
      "omi cron",
      "big sqcup",
      "Ġ ?",
      "nu p",
      "tharpoo nup",
      "text tt",
      "footnote size",
      "v dash",
      "hook rightarrow",
      "text sc",
      "\\ #",
      "righ tharpoonup",
      "big vee",
      "lar ge",
      "ta bu",
      "tabu lar",
      "la p",
      "supset eq",
      "em ph",
      "T i",
      "Ti lde",
      "Ġ \"",
      "th ing",
      "var no",
      "varno thing",
      "se c",
      "r times",
      "Ġ `",
      "ra l",
      "triangle right",
      "\\ ;",
      "m in",
      "dots b",
      "se arrow",
      "m kern",
      "p lus",
      "me d",
      "box plus",
      "ã Ģ",
      "L ar",
      "Lar ge",
      "t u",
      "ra i",
      "na tu",
      "arc sin",
      "natu ral",
      "rai se",
      "n mid",
      "r hd",
      "\\ :",
      "triangle left",
      "med skip",
      "c sc",
      "d le",
      "mid dle",
      "ãĢ ģ",
      "h f",
      "en skip",
      "de g",
      "cdot p",
      "t s",
      "ge ts",
      "box ed",
      "prec eq",
      "a sym",
      "asym p",
      "o n",
      "ar g",
      "A A",
      "n er",
      "Ġ\\ &",
      "int er",
      "inter cal",
      "c op",
      "pro jlim",
      "o u",
      "Ġ ãĢģ",
      "subset neq",
      "ro d",
      "cop rod",
      "p ou",
      "s mi",
      "var projlim",
      "nd s",
      "pou nds",
      "smi le",
      "d rel",
      "bu il",
      "buil drel",
      "ne arrow",
      "small setminus",
      "Ġ\\ /",
      "in jlim",
      "succ eq",
      "lo w",
      "i ll",
      "p ut",
      "ot ect",
      "pr otect",
      "var injlim",
      "pre script",
      "r ut",
      "st rut",
      "ln ot",
      "i iint",
      "n frac",
      "r lap",
      "ve r",
      "ge nfrac",
      "\\ !",
      "in top",
      "su it",
      "g t",
      "s l",
      "hf ill",
      "math ver",
      "si on",
      "dots m",
      "mathver sion",
      "d dagger",
      "gt r",
      "ma x",
      "k e",
      "ma ke",
      "make box",
      "p e",
      "u se",
      "be ca",
      "beca use",
      "B ar",
      "a k",
      "no align",
      "bre ak",
      "le ng",
      "leng th",
      "t ch",
      "u le",
      "bigtriangle down",
      "f row",
      "l hd",
      "frow n",
      "i psi",
      "v space",
      "math ell",
      "rc or",
      "re al",
      "ipsi s",
      "mathell ipsis",
      "rcor ner",
      "m o",
      "Ġ â",
      "nu ll",
      "mo de",
      "Ġâ Ģ",
      "l s",
      "l rcorner",
      "m space",
      "gtr sim",
      "mode ls",
      "small skip",
      "v line",
      "Ġ\\ *",
      "co l",
      "B bb",
      "arpoo n",
      "Bbb k",
      "al low",
      "r ule",
      "u ph",
      "uph arpoon",
      "h slash",
      "l lap",
      "ĠâĢ Ĳ",
      "upharpoon right",
      "de set",
      "si deset",
      "allow break",
      "l times",
      "la be",
      "big m",
      "raise box",
      "labe l",
      "array st",
      "re tch",
      "arrayst retch",
      "big star",
      "se p",
      "sma sh",
      "diamond suit",
      "s ha",
      "sha pe",
      "col sep",
      "n s",
      "tharpoo ns",
      "Ġ\\ -",
      "ne w",
      "c e",
      "normal size",
      "array colsep",
      "th in",
      "right lef",
      "rightlef tharpoons",
      "S S",
      "h e",
      "da st",
      "set length",
      "circle dast",
      "ce nt",
      "u re",
      "pi ct",
      "pict ure",
      "thin space",
      "d dag",
      "h phantom",
      "m ma",
      "r d",
      "su rd",
      "co mma",
      "comma nd",
      "up lus",
      "new command",
      "re newcommand",
      "Ve c",
      "li mit",
      "Ġ-- -",
      "V dash",
      "e th",
      "long leftarrow",
      "c u",
      "leq q",
      "cu r",
      "o slash",
      "su re",
      "math c",
      "big circ",
      "en sure",
      "ensure math",
      "x leftarrow",
      "var lim",
      "int e",
      "triangle down",
      "r ner",
      "s ho",
      "math or",
      "co rner",
      "sho rt",
      "mathor d",
      "Ġc m",
      "rt ex",
      "inte rtex",
      "intertex t",
      "hf il",
      "a n",
      "big skip",
      "w r",
      "var triangle",
      "w arrow",
      "up downarrow",
      "a e",
      "math rel",
      "end aligned"
    ]
  }
}